source/_posts/2014-04-27-golang单元测试.html
---
title: "Golang单元测试"
date: 2014-04-27
layout: post
categories: Go
published: true
comments: true
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Golang 单元测试</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">哲学</h3>
<div class="outline-text-3" id="text-1-1">
<blockquote>
<p>
测试只能证明你的代码有问题，不能证明你的代码没有问题。
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">测似的粒度</h3>
<div class="outline-text-3" id="text-1-2">
<p class="verse">
老板为我的代码付报酬，而不是测试，所以，我对此的价值观是——测试越少越好，<br  />
少到你对你的代码质量达到了某种自信（我觉得这种的自信标准应该要高于业内的<br  />
标准，当然，这种自信也可能是种自大）。如果我的编码生涯中不会犯这种典型的<br  />
错误（如：在构造函数中设了个错误的值），那我就不会测试它。我倾向于去对<br  />
那些有意义的错误做测试，所以，我对一些比较复杂的条件逻辑会异常地小心。<br  />
当在一个团队中，我会非常小心的测试那些会让团队容易出错的代码。<br  />
<br  />
个人理解：测试需要测有意义的东西，而不是盲目的100%覆盖，需要的是恰到好处<br  />
的UT。<br  />
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">TDD(测试驱动开发)</h3>
<div class="outline-text-3" id="text-1-3">
<p class="verse">
个人理解：<br  />
1. 测试不能帮助你写出优秀的设计，只能保证你写的代码不出错。<br  />
2. 软件开发是一种发现问题解决问题的过程，TDD并不能达到这样<br  />
&#xa0;&#xa0;&#xa0;的效果。<br  />
3. TDD保证代码正确，但是什么来保证TDD的case是正确的。<br  />
4. TDD的好处大多是理论上的，实际上是不是只有做过才知道。<br  />
5. 决定软件工艺的还是设计，程序员需要知道怎么思考，怎么设计，<br  />
&#xa0;&#xa0;&#xa0;怎么测试，而不是教条主义的照搬某某理论，某某Best Practice。<br  />
6. 软件工程是没有银弹的，TDD也许适合你的项目，你的编程风格，<br  />
&#xa0;&#xa0;&#xa0;但是不一定适合所有人。<br  />
<br  />
总结： 软件需要的是恰到好处的设计和单元测试。<br  />
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Go语言中的单元测试</h3>
<div class="outline-text-3" id="text-1-4">
<p>
go语言自带 <b>testing</b> 测试框架， <b>go test</b> 命令可以运行单元测试和性能测试。<br  />
</p>
</div>

<div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1">使用</h4>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">exa.go 文件</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff; font-weight: bold;">package</span> main

<span style="color: #00ffff; font-weight: bold;">import</span> <span style="color: #00ff00;">"fmt"</span>

<span style="color: #00ffff; font-weight: bold;">func</span> <span style="color: #0000ff; font-weight: bold;">Add</span>(x, y int) int {
        <span style="color: #00ffff; font-weight: bold;">return</span> x + y
}

<span style="color: #00ffff; font-weight: bold;">func</span> <span style="color: #0000ff; font-weight: bold;">main</span>() {
        x, y := 1, 2
        fmt.<span style="color: #0000ff; font-weight: bold;">Println</span>(<span style="color: #0000ff; font-weight: bold;">Add</span>(x, y))
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">exa_test.go 测试文件</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff; font-weight: bold;">package</span> main

<span style="color: #00ffff; font-weight: bold;">import</span> (
        <span style="color: #00ff00;">"testing"</span>
)

<span style="color: #00ffff; font-weight: bold;">func</span> <span style="color: #0000ff; font-weight: bold;">TestAdd</span>(t *testing.T) {
        <span style="color: #00ffff; font-weight: bold;">if</span> x := <span style="color: #0000ff; font-weight: bold;">Add</span>(1, 3); x != 4 {
                t.<span style="color: #0000ff; font-weight: bold;">Error</span>(<span style="color: #00ff00;">"error in test Add"</span>)
        }
        <span style="color: #00ffff; font-weight: bold;">if</span> x := <span style="color: #0000ff; font-weight: bold;">Add</span>(1, 3); x != 5 {
                t.<span style="color: #0000ff; font-weight: bold;">Error</span>(<span style="color: #00ff00;">"error in test Add 5"</span>)
        }
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ff0000;"># </span><span style="color: #ff0000;">&#22312;&#24403;&#21069;&#25991;&#20214;&#22841;&#36816;&#34892;go test&#20415;&#21487;&#20197;&#36816;&#34892;&#27979;&#35797;</span>
go test
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">使用原则</h3>
<div class="outline-text-3" id="text-1-7">
<p class="verse">
1. 文件名必须是_test.go结尾的，这样在执行go test的时候才会执行到相应的代码<br  />
2. 你必须import testing这个包<br  />
3. 所有的测试用例函数必须是Test开头<br  />
4. 测试用例会按照源代码中写的顺序依次执行<br  />
5. 测试函数TestXxx()的参数是testing.T，我们可以使用该类型来记录错误或者是<br  />
&#xa0;&#xa0;&#xa0;测试状态<br  />
6. 测试格式：func TestXxx (t *testing.T),Xxx部分可以为任意的字母数字的组合，<br  />
&#xa0;&#xa0;&#xa0;但是首字母不能是小写字母[a-z]，例如Testintdiv是错误的函数名。<br  />
7. 函数中通过调用testing.T的Error, Errorf, FailNow, Fatal, FatalIf方法，<br  />
&#xa0;&#xa0;&#xa0;说明测试不通过，调用Log方法用来记录测试的信息。<br  />
</p>
</div>
</div>


<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8">参考</h3>
<div class="outline-text-3" id="text-1-8">
<p class="verse">
<a href="http://coolshell.cn/articles/8209.html">http://coolshell.cn/articles/8209.html</a><br  />
<a href="https://github.com/astaxie/build-web-application-with-golang/blob/master/ebook/11.3.md">https://github.com/astaxie/build-web-application-with-golang/blob/master/ebook/11.3.md</a><br  />
</p>
<p>
<!-- more -->
</p>
</div>
</div>
</div>
